# MAMBORADAR | Made by MAMBOVSKIY.
# Owner: @MAMBA_MYD00M | Channel: @webratcrack
import asyncio
import socket
import time
import mcstatus

print(r"""
                                                                                                                       
          ____                                                                                                         
        ,'  , `.                      ____                      ,-.----.                                               
     ,-+-,.' _ |                    ,'  , `.  ,---,             \    /  \                   ,---,                      
  ,-+-. ;   , ||                 ,-+-,.' _ |,---.'|      ,---.  ;   :    \                ,---.'|              __  ,-. 
 ,--.'|'   |  ;|              ,-+-. ;   , |||   | :     '   ,'\ |   | .\ :                |   | :            ,' ,'/ /| 
|   |  ,', |  ':  ,--.--.    ,--.'|'   |  ||:   : :    /   /   |.   : |: |   ,--.--.      |   | |   ,--.--.  '  | |' | 
|   | /  | |  || /       \  |   |  ,', |  |,:     |,-..   ; ,. :|   |  \ :  /       \   ,--.__| |  /       \ |  |   ,' 
'   | :  | :  |,.--.  .-. | |   | /  | |--' |   : '  |'   | |: :|   : .  / .--.  .-. | /   ,'   | .--.  .-. |'  :  /   
;   . |  ; |--'  \__\/: . . |   : |  | ,    |   |  / :'   | .; :;   | |  \  \__\/: . ..   '  /  |  \__\/: . .|  | '    
|   : |  | ,     ," .--.; | |   : |  |/     '   : |: ||   :    ||   | ;\  \ ," .--.; |'   ; |:  |  ," .--.; |;  : |    
|   : '  |/     /  /  ,.  | |   | |`-'      |   | '/ : \   \  / :   ' | \.'/  /  ,.  ||   | '/  ' /  /  ,.  ||  , ;    
;   | |`-'     ;  :   .'   \|   ;/          |   :    |  `----'  :   : :-' ;  :   .'   \   :    :|;  :   .'   \---'     
|   ;/         |  ,     .-./'---'           /    \  /           |   |.'   |  ,     .-./\   \  /  |  ,     .-./         
'---'           `--`---'                    `-'----'            `---'      `--`---'     `----'    `--`---'             
                                                                                                                       
""")

print("Scan in progress. Please wait, this may take a while!")
print("# Owner: @MAMBA_MYD00M | Channel: @webratcrack")
print("-" * 50)

f = open("found.txt", "w", encoding="utf-8")
try:
    hosts = open("pubs.txt").read().splitlines()
except:
    hosts = []

async def check(ip, port):
    try:
        r, w = await asyncio.wait_for(asyncio.open_connection(ip, port), 1)
        w.close()
    except:
        return

    try:
        server = mcstatus.JavaServer(ip, port)
        start = time.time()
        status = await server.async_status()
        end = time.time()
        
        ping = int((end - start) * 1000)
        motd = " ".join(str(status.description).split())
        res = f"{ip}:{port} | {status.version.name} | {status.players.online}/{status.players.max} | {ping}ms | {motd}"
        
        print(f"[+] FOUND: {res}")
        f.write(res + "\n")
    except:
        pass

async def scan():
    while True:
        for host in hosts:
            if not host.strip(): continue
            try:
                ip = socket.gethostbyname(host)
            except:
                continue
                
            print(f"[*] Started scanning host: {host}")
            
            ports = list(range(10000, 65536))
            for i in range(0, len(ports), 1000):
                batch = ports[i:i+1000]
                tasks = [check(ip, p) for p in batch]
                await asyncio.gather(*tasks)
                await asyncio.sleep(0.05)

loop = asyncio.new_event_loop()
loop.run_until_complete(scan())

#
#⠀⠀⠀⠀⣠⠤⢄⡀⠀⠀⢠⡖⢄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
#⠀⠀⠀⠀⡏⠀⢀⣹⠦⠤⠬⡗⠀⠙⢆⡀⠀⣀⡤⠔⠚⡷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
#⠀⠀⠀⠀⡇⠀⠈⠑⠲⠶⠀⠀⠀⠀⠀⠱⠚⠁⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
#⠀⠀⠀⢐⡇⠀⢀⣠⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠅⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
#⠀⠀⠀⠀⡇⣠⠟⢠⣿⡀⠀⠀⣸⠟⠛⣄⠀⠀⠀⠀⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
#⠀⠀⠀⣠⠏⠟⠀⢾⣿⠀⠀⠀⠛⠀⢸⣿⡆⠀⠀⢸⣥⠤⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
#⠀⠀⠀⢷⡀⠀⠈⠋⠓⠀⠀⠀⠀⠀⠈⠛⠁⠀⠀⠀⣠⠞⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
#⠀⠀⠀⠀⠑⢦⣀⡀⠢⡴⣄⣤⠀⠀⠀⠀⠀⣠⣀⣀⣘⡄⠀⠀⠀⠀⠀⠀⢀⣦⠀⠀⢠⡀⠀
#⠀⠀⠀⠀⠀⠘⣯⣉⠀⠀⠀⠀⠀⠀⠀⠙⢛⡿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⡼⠈⣇⢀⡏⢧⠀
#⢀⣀⡤⠤⠖⠚⣩⠏⠀⠀⢠⡀⠀⠀⠀⢠⠤⠵⠄⠀⠀⠀⠀⠀⠀⠀⠀⣸⠃⠀⢿⡼⠀⢸⠀
#⡏⠀⠀⠀⠀⠀⣉⢩⣏⡴⠋⠀⠀⠀⠀⠀⢳⡀⠀⠀⠀⠀⠀⠀⠀⢀⡴⠃⠀⠀⠘⠁⠀⢸⠄
#⠙⠒⠲⠒⠚⠋⢁⡞⠋⠀⠀⠀⠀⠀⠀⠀⠀⠑⣆⢀⣄⣠⠤⠴⠒⠋⠀⠀⠀⠀⠀⠀⠀⡼⠀
#⠀⠀⠀⠀⠀⠀⠻⣀⣀⣀⣀⠴⠋⠁⠀⠀⠀⠀⠘⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⠃⠀
#⠀⠀⠀⠀⠀⠀⠀⡇⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣚⠁⠀⠀
#⠀⠀⠀⠀⠀⠀⢸⠁⠀⠀⠀⠀⣴⠛⢹⠀⠀⠀⠈⣿⠀⠀⠀⠀⠀⠀⠀⠀⠘⠉⣽⠚⠀⠀⠀
#⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⠀⢰⠋⠀⡼⠀⠀⠀⠀⢻⠒⠄⣄⣀⣀⣀⣠⠤⠖⠋⠁⠀⠀⠀⠀
#⠀⠀⠀⠀⠀⠀⢷⠀⠀⠀⠀⠘⣆⠀⡇⠀⠀⠀⠀⠀⢣⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
#⠀⠀⠀⠀⠀⠀⠈⣧⠀⠀⠀⠀⢹⠀⢳⡀⠀⠀⠀⠀⢀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
#⠀⠀⠀⠀⠀⠀⠀⠙⡆⠀⠀⣀⣿⠀⠀⠹⣄⡄⠤⡴⠊⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
#⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⡋⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀